nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/demo_apps/bubble_peripheral/peripherals.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PERIPHERALS_H_
#define _PERIPHERALS_H_

/***********************************************************************************************************************
 * Included files
 **********************************************************************************************************************/
#include "fsl_device_registers.h"
#include "Cpu.h"

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/
/* Definitions for BOARD_InitPeripherals functional group */
/* Definition of peripheral ID */
#define TIMER_PERIPHERAL TMRA
/* Definition of the timer channel 0 clock source frequency. */
#define TIMER_CHANNEL_0_CLOCK_SOURCE 50000000UL
/* Definition of the timer enable mask for all channels. */
#define TIMER_ENBL_INIT_MASK TMR_ENBL_ENBL_MASK
/* TMRA_COMP10: COMPARISON_1=10000 */
#define TIMER_COMP10_INIT 0x2710U
/* TMRA_COMP20: COMPARISON_2=0 */
#define TIMER_COMP20_INIT 0x0U
/* TMRA_LOAD0: LOAD=0 */
#define TIMER_LOAD0_INIT 0x0U
/* TMRA_CNTR0: COUNTER=0 */
#define TIMER_CNTR0_INIT 0x0U
/* TMRA_CTRL0: CM=1, PCS=8, SCS=0, ONCE=0, LENGTH=1, DIR=0, COINIT=0, OUTMODE=0 */
#define TIMER_CTRL0_INIT 0x3020U
/* TMRA_SCTRL0: TCFIE=0, TOFIE=0, IEFIE=0, IPS=0, CAPTURE_MODE=0, MSTR=0, EEOF=0, VAL=0, FORCE=0, OPS=0, OEN=0 */
#define TIMER_SCTRL0_INIT 0x0U
/* TMRA_CMPLD10: COMPARATOR_LOAD_1=10000 */
#define TIMER_CMPLD10_INIT 0x2710U
/* TMRA_CMPLD20: COMPARATOR_LOAD_2=0 */
#define TIMER_CMPLD20_INIT 0x0U
/* TMRA_CSCTRL0: DBG_EN=0, FAULT=0, ALT_LOAD=0, ROC=0, TCI=0, TCF2EN=0, TCF1EN=1, CL2=0, CL1=1 */
#define TIMER_CSCTRL0_INIT 0x41U
/* TMRA_FILT0: FILT_CNT=0, FILT_PER=0 */
#define TIMER_FILT0_INIT 0x0U
/* TMRA_DMA0: CMPLD2DE=0, CMPLD1DE=0, IEFDE=0 */
#define TIMER_DMA0_INIT 0x0U
/* TMRA_ENBL: ENBL=1 */
#define TIMER_ENBL_INIT 0x1U
/* TMRA_FILT1: FILT_CNT=0, FILT_PER=0 */
#define TIMER_FILT1_INIT 0x0U
/* TMRA_FILT2: FILT_CNT=0, FILT_PER=0 */
#define TIMER_FILT2_INIT 0x0U
/* TMRA_FILT3: FILT_CNT=0, FILT_PER=0 */
#define TIMER_FILT3_INIT 0x0U
/* TIMER interrupt vector ID (number). */
#define TIMER_CHANNEL_0_IRQN kTMRA_0_VECTORn
/* TIMER interrupt priority register (interrupt priority register/bitfield index). */
#define TIMER_CHANNEL_0_IRQ TMRA_0_IRQn
/* TIMER interrupt handler identifier. */
#define TIMER_IRQ_HANDLER ivINT_TMRA_0
/* LPI2C1_MCR: RRF=1, RTF=1, DBGEN=0, DOZEN=0, MEN=1 */
#define LPI2C1_MCR_INIT 0x301U
/* LPI2C1_MIER: DMIE=0, PLTIE=0, FEIE=0, ALIE=0, NDIE=0, SDIE=0, EPIE=0, RDIE=0, TDIE=0 */
#define LPI2C1_MIER_INIT 0x0U
/* LPI2C1_MDER: RDDE=0, TDDE=0 */
#define LPI2C1_MDER_INIT 0x0U
/* LPI2C1_MCFGR0: RDMO=0, CIRFIFO=0, HRSEL=0, HRPOL=0, HREN=0 */
#define LPI2C1_MCFGR0_INIT 0x0U
/* LPI2C1_MCFGR1: FRCHS=0, PINCFG=0, TIMECFG=0, IGNACK=0, AUTOSTOP=0, MATCFG=0, PRESCALE=0 */
#define LPI2C1_MCFGR1_INIT 0x0U
/* LPI2C1_MCFGR2: BUSIDLE=0 */
#define LPI2C1_MCFGR2_INIT 0x0U
/* LPI2C1_MCFGR3: FILTSDA=0, FILTSCL=0 */
#define LPI2C1_MCFGR3_INIT 0x0U
/* LPI2C1_MCFGR4: PINLOW=0 */
#define LPI2C1_MCFGR4_INIT 0x0U
/* LPI2C1_MDMR: MATCH1=0, MATCH0=0 */
#define LPI2C1_MDMR_INIT 0x0U
/* LPI2C1_MCCR0: CLKHI=60, CLKLO=61 */
#define LPI2C1_MCCR0_INIT 0x3C3DU
/* LPI2C1_MCCR1: DATAVD=30, SETHOLD=30 */
#define LPI2C1_MCCR1_INIT 0x1E1EU
/* LPI2C1_MCCR2: CLKHI=21, CLKLO=25 */
#define LPI2C1_MCCR2_INIT 0x1519U
/* LPI2C1_MCCR3: DATAVD=10, SETHOLD=10 */
#define LPI2C1_MCCR3_INIT 0xA0AU
/* LPI2C1_MFCR: RXWATER=0, TXWATER=0 */
#define LPI2C1_MFCR_INIT 0x0U

/***********************************************************************************************************************
 * Initialization functions
 **********************************************************************************************************************/

void BOARD_InitPeripherals(void);

/***********************************************************************************************************************
 * BOARD_InitBootPeripherals function
 **********************************************************************************************************************/
void BOARD_InitBootPeripherals(void);

#if defined(__cplusplus)
}
#endif

#endif /* _PERIPHERALS_H_ */
